{
  "name": "UBX-CFG-ANT",
  "class_id": "0x06",
  "message_id": "0x13",
  "message_type": "get_set",
  "description": "Antenna control settings. This message allows the user to configure the antenna supervisor. The antenna supervisor can be used to detect the status of an active antenna and control it. It can be used to turn off the supply to the antenna in the event of a short circuit (for example) or to manage power consumption in power save mode. Refer to antenna supervisor configuration in the Integration manual for more information regarding the behavior of the antenna supervisor. Note that not all pins can be used for antenna supervisor operation, it is recommended that you use the default pins, consult the Integration manual if you need to use other pins. This message is deprecated in protocol versions greater than 23.01. Use UBX-CFG-VALSET, UBX-CFG-VALGET, UBX-CFG-VALDEL instead. See the Legacy UBX Message Fields Reference for the corresponding configuration item.",
  "payload": {
    "length": {
      "fixed": 4
    },
    "fields": [
      {
        "name": "flags",
        "byte_offset": 0,
        "data_type": "X2",
        "description": "Antenna flag mask. Bitfields: bit 0 (svcs): Enable antenna supply voltage control signal; bit 1 (scd): Enable short circuit detection; bit 2 (ocd): Enable open circuit detection; bit 3 (pdwnOnSCD): Power down antenna supply if short circuit is detected. (only in combination with bit 1); bit 4 (recovery): Enable automatic recovery from short state."
      },
      {
        "name": "pins",
        "byte_offset": 2,
        "data_type": "X2",
        "description": "Antenna pin configuration. Bitfields: bits 4...0 (pinSwitch): PIO-pin used for switching antenna supply; bits 9...5 (pinSCD): PIO-pin used for detecting a short in the antenna supply; bits 14...10 (pinOCD): PIO-pin used for detecting open/not connected antenna; bit 15 (reconfig): if set to one, and this command is sent to the receiver, the receiver will reconfigure the pins as specified."
      }
    ]
  }
}